Repository: Softcatala/translation-memory-tools
Catalog: latest-memories/tmx/mailman-tm.tmx
Source language: en
Languages: ca_es

source: %(listname)s has both public and private mbox archives. Since this list currently uses private archiving, I'm installing the private mbox archive -- %(o_pri_mbox_file)s -- as the active archive, and renaming %(o_pub_mbox_file)s to %(o_pub_mbox_file)s.preb6 You can integrate that into the archives if you want by using the 'arch' script.
ca_es: %(listname)s té fitxers mbox públics i privats. Ja que la llista està fent servir arxivació privada, Instalo el fitxer mbox privat -- %(o_pri_mbox_file)s -- com a arxiu actiu, i renombro %(o_pub_mbox_file)s a %(o_pub_mbox_file)s.preb6 Podeu integrar això amb els arxius si voleu, fent servir el script 'arch'.

source: %s has both public and private mbox archives. Since this list currently uses public archiving, I'm installing the public mbox file archive file (%s) as the active one, and renaming %s to %s.preb6 You can integrate that into the archives if you want by using the 'arch' script.
ca_es: %s té fitxers mbox públics i privats. Ja qeu aquesta llista fa servir arxivació pública, instal·lo el fitxer públic mbox (%s) com a fitxer actiu, i li canviare el nom de %s a %s.preb6 Podeu integrar això amb els arxius si voleu, fent servir l'script 'arch'.

source: - updating old private mbox file
ca_es: - s'està actualitzant l'antic fitxer mbox privat

source: unknown file in the way, moving %(o_pri_mbox_file)s to %(newname)s
ca_es: Fitxer desconegut, movent %(o_pri_mbox_file)s a %(newname)s

source: looks like you have a really recent CVS installation... you're either one brave soul, or you already ran me
ca_es: sembla que teniu una instal·lació molt recent del CVS... o sou molt valent, o ja s'ha executat

source: - updating old public mbox file
ca_es: - s'està actualitzant el fitxer mbox públic antic

source: unknown file in the way, moving %(o_pub_mbox_file)s to %(newname)s
ca_es: fitxer desconegut, movent %(o_pub_mbox_file)s a %(newname)s

source: - This list looks like it might have <= b4 list templates around
ca_es: - Sembla que aquesta llista té plantilles <= b4

source: - moved %(o_tmpl)s to %(n_tmpl)s
ca_es: - mogut %(o_tmpl)s a %(n_tmpl)s

source: - both %(o_tmpl)s and %(n_tmpl)s exist, leaving untouched
ca_es: - %(o_tmpl)s i %(n_tmpl)s existeixen, els deixo com estan.

source: - %(o_tmpl)s doesn't exist, leaving untouched
ca_es: - no existeix %(o_tmpl)s; no es modificarà

source: removing directory %(src)s and everything underneath
ca_es: s'està suprimint el directori %(src)s i tot el seu contingut

source: removing %(src)s
ca_es: s'està suprimint %(src)s

source: Warning: couldn't remove %(src)s -- %(rest)s
ca_es: Atenció: no es pot eliminar %(src)s -- %(rest)s

source: couldn't remove old file %(pyc)s -- %(rest)s
ca_es: No es pot eliminar l'antic fitxer %(pyc)s -- %(rest)s

source: updating old qfiles
ca_es: S'estan actualitzant els antics qfiles

source: Warning! Not a directory: %(dirpath)s
ca_es: Avís! No és un directori: %(dirpath)s

source: message is unparsable: %(filebase)s
ca_es: no es pot analitzar el missatge: %(filebase)s

source: Warning! Deleting empty .pck file: %(pckfile)s
ca_es: Avís! S'està suprimint un fitxer .pck buit: %(pckfile)s

source: Updating Mailman 2.0 pending_subscriptions.db database
ca_es: S'està actualitzant la base de dades pending_subscriptions.db del MAilman 2.0

source: Updating Mailman 2.1.4 pending.pck database
ca_es: S'està actualitzant la base de dades pending.pck del Mailman 2.1.4

source: getting rid of old source files
ca_es: supressió dels dels fitxers font vells

source: no lists == nothing to do, exiting
ca_es: si no hi ha llistes, no hi ha res per fer, per la qual cosa se sortirà

source: fixing all the perms on your old html archives to work with b6 If your archives are big, this could take a minute or two...
ca_es: s'estan reparant els permisos als vostres fitxers html antics per a treballar amb b6 Si els vostres arxius són grans, això pot trigar un minut o dos...

source: done
ca_es: fet

source: Updating mailing list: %(listname)s
ca_es: S'està actualitzant la llista de correu: %(listname)s

source: Updating Usenet watermarks
ca_es: S'estan actualitzant les marques d'aigua de l'Usenet

source: - nothing to update here
ca_es: - aquí no hi ha res per a actualitzar

source: - usenet watermarks updated and gate_watermarks removed
ca_es: - s'han suprimit les marques d' aigua i les gate_watermarks de l'Usenet

source: NOTE NOTE NOTE NOTE NOTE You are upgrading an existing Mailman installation, but I can't tell what version you were previously running. If you are upgrading from Mailman 1.0b9 or earlier you will need to manually update your mailing lists. For each mailing list you need to copy the file templates/options.html lists/<listname>/options.html. However, if you have edited this file via the Web interface, you will have to merge your changes into this file, otherwise you will lose your changes. NOTE NOTE NOTE NOTE NOTE
ca_es: Atenció Atenció Atenció Estàs actualitzant una versió existent de Mailman, però no puc dir quina versió és. Si estàs actualitzant desde Mailman 1.0b9 o anterior hauràs d'actualitzar manualment les teves llistes de correu. Per cada llista hauràs de copiar el fitxer templates/options.html lists/<nom de la llista>/options.html. No obstant, si haguessis editat aquest fitxer a través de l'interfície web, hauràs de barrejar els teus canvis amb aquest fitxer, d'altra manera perdràs els teus canvis. Atenció Atenció Atenció

source: No updates are necessary.
ca_es: No cal fer cap actualització.

source: Downgrade detected, from version %(hexlversion)s to version %(hextversion)s This is probably not safe. Exiting.
ca_es: Reculada detectada, de la versió %(hexlversion)s a la versió %(hextversion)s El més probable que això no sigui segur. Sortint.

source: Upgrading from version %(hexlversion)s to %(hextversion)s
ca_es: S'està actualitzant la versió %(hexlversion)s a la %(hextversion)s

source: ERROR: The locks for some lists could not be acquired. This means that either Mailman was still active when you upgraded, or there were stale locks in the %(lockdir)s directory. You must put Mailman into a quiescent state and remove all stale locks, then re-run "make update" manually. See the INSTALL and UPGRADE files for details.
ca_es: ERROR: No s'ha pogut obtenir el bloqueig d'algunes llistes. Això significa que o Mailman estava actiu quan vas actualitzar o hi havia bloquejos corruptes en el directori %(lockdir)s. Has de posar a Mailman en un estat inactiu i esborrar tots els bloquejos corruptes, aleshores tornar a executar manualment "make update". Vegi els fitxers INSTALL i UPGRADE per a més detalls.

source: Print the Mailman version.
ca_es: Mostra la versió del Mailman.

source: Using Mailman version:
ca_es: S'està fent servir la versió del Mailman:

source: Unlock a locked list, but do not implicitly Save() it. This does not get run if the interpreter exits because of a signal, or if os._exit() is called. It will get called if an exception occurs though.
ca_es: Desbloquejar una llista bloquejada, però no desar-la implícitament. Això no aconsegueix executar-se si l'intèrpret surt a causa d'un senyal, o si es crida a os._exit() . Se'l cridarà si ocorre una excepció.

source: Unlocking (but not saving) list: %(listname)s
ca_es: S'està desbloquejant (però no desant) la llista: %(listname)s

source: Finalizing
ca_es: S'està finalitzant

source: Loading list %(listname)s
ca_es: S'està carregant la llista %(listname)s

source: (locked)
ca_es: (blocat)

source: (unlocked)
ca_es: (desblocat)

source: Unknown list: %(listname)s
ca_es: Llista desconeguda: %(listname)s

source: No list name supplied.
ca_es: Nom de la llista no proporcionat.

source: --all requires --run
ca_es: --all necessita --run

source: Importing %(module)s...
ca_es: Important %(module)s...

source: Running %(module)s.%(callable)s()...
ca_es: Executant %(module)s.%(callable)s()...

source: The variable `m' is the %(listname)s MailList instance
ca_es: La variable «m» és la instància de la llista de correu %(listname)s

source: Increment the digest volume number and reset the digest number to one. Usage: %(PROGRAM)s [options] [listname ...] Options: --help/-h Print this message and exit. The lists named on the command line are bumped. If no list names are given, all lists are bumped.
ca_es: Incrementa el número de volum de resum i reinicialitza el número de resum a 1. Forma d'ús: %(PROGRAM)s [opcions] [nomdelallista ...] Opcions: --help/-h Mostra aquest missatge d'ajuda i surt. S'incrementaran totes les llistes especificades a la línia d'ordres. En cas que no s'especifiqui cap llista, s'incrementaran totes.

source: Check for pending admin requests and mail the list owners if necessary. Usage: %(PROGRAM)s [options] Options: -h/--help Print this message and exit.
ca_es: Comprova si hi ha sol·licituds d'administració pendents i notifica-ho als propietaris de la llista per correu en cas que sigui necessari. Forma d'ús: %(PROGRAM)s [opcions] Opcions: -h/--help Mostra aquest missatge d'ajuda i surt.

source: Notice: %(discarded)d old request(s) automatically expired.
ca_es: Avís: han expirat automàticament %(discarded)d sol·licituds antigues.

source: %(count)d %(realname)s moderator request(s) waiting
ca_es: Hi ha %(count)d sol·licituds de moderació de la llista %(realname)s per processar

source: %(realname)s moderator request check result
ca_es: resultat de la comprovació de la petició de moderació de %(realname)s

source: Pending subscriptions:
ca_es: Subscripcions pendents:

source: Pending posts:
ca_es: Enviaments pendents:

source: From: %(sender)s on %(date)s Subject: %(subject)s Cause: %(reason)s
ca_es: De: %(sender)s el %(date)s Assumpte: %(subject)s Causa: %(reason)s

source: Cull bad and shunt queues, recommended once per day. This script goes through the 'bad' and 'shunt' queue directories and, if mm_cfg.BAD_SHUNT_STALE_AFTER is > 0, it removes all files more than that many seconds old. If mm_cfg.BAD_SHUNT_ARCHIVE_DIRECTORY is a writable directory, the old files are moved there. Otherwise they are deleted. Only regular files immediately subordinate to the 'bad' and 'shunt' directories are processed. Anything else is skipped. Usage: %(PROGRAM)s [options] Options: -h / --help Print this message and exit.
ca_es: Selecciona les cues de missatges erronis i de relegacions, recomanable un cop al dia. Aquest script analitza les cues de missatges erronis («bad») i de relegacions («shunt») i en suprimeix els fitxers més antics que el nombre de segons especificats al valor «mm_cfg.BAD_SHUNT_STALE_AFTER» en cas que sigui major que 0. Si el directori especificat a «mm_cfg.BAD_SHUNT_ARCHIVE_DIRECTORY» és d'escriptura, s'hi traslladaran els fitxers antics. En cas contrari, se suprimiran. Només es processaran els fitxers normals immediatament subordinats als directoris «bad» i «shunt». Qualsevol altre element s'ometrà. Forma d'ús: %(PROGRAM)s [opcions] Opcions: -h / --help Mostra aquest missatge i surt.

source: Process disabled members, recommended once per day. This script cruises through every mailing list looking for members whose delivery is disabled. If they have been disabled due to bounces, they will receive another notification, or they may be removed if they've received the maximum number of notifications. Use the --byadmin, --byuser, and --unknown flags to also send notifications to members whose accounts have been disabled for those reasons. Use --all to send the notification to all disabled members. Usage: %(PROGRAM)s [options] Options: -h / --help Print this message and exit. -o / --byadmin Also send notifications to any member disabled by the list owner/administrator. -m / --byuser Also send notifications to any member disabled by themselves. -u / --unknown Also send notifications to any member disabled for unknown reasons (usually a legacy disabled address). -b / --notbybounce Don't send notifications to members disabled because of bounces (the default is to notify bounce disabled members). -a / --all Send notifications to all disabled members. -f / --force Send notifications to disabled members even if they're not due a new notification yet. -l listname --listname=listname Process only the given list, otherwise do all lists.
ca_es: Processar als subscriptors inhabilitats, es recomana una vegada al dia. Aquest programa recorre cadascuna de les llistes de distribució buscant aquells subscriptors que tinguin la recepció del correu desactivada. Si els ha estat desactivat a causa de rebots, rebran una notificació o se'ls donarà de baixa en cas que les notificacions rebudes hagin superat el màxim establert. Utilitzi les opcions --byadmin, --byuser i --unknown per a enviar-li les notificacions a aquells subscriptors que hagin estat inhabilitats per aquestes raons. Utilitzi l'opció --all per a enviar-li la notificació a tots els subscriptors inhabilitats. Sintaxi: %(PROGRAM)s [opcions] Opcions: -h / --help Mostra aquest missatge d'ajuda i surt. -o / --byadmin Enviar-li també les notificacions als subscriptors desactivats pel propietari/moderador. -m / --byuser Enviar-li també les notificacions als subscriptors que s'hagin desactivat ells mateixos. -u / --unknown Enviar-li també les notificacions als subscriptors desactivats per raons desconegudes. (l'opció per defecte és enviar-li la notificació als subscriptors desactivats degut a missatges rebotats). -b / --notbybounce No enviar-li notificacions als subscriptors que hagin estat desactivats a causa dels missatges rebotats. -a / --all enviar-li les notificacions a tots els subscriptors inhabilitats. -f / --force enviar-li les notificacions als subscriptors inhabilitats fins i tot si encara no cal eniar-lis. -l listname / --listname=listname Processar les llistes donades, en cas contrari es processen totes les llistes.

source: [disabled by periodic sweep and cull, no message available]
ca_es: [inhabilitat a causa de una neteja periòdica, no hi ha cap missatge disponible]

source: Poll the NNTP servers for messages to be gatewayed to mailing lists. Usage: gate_news [options] Where options are --help -h Print this text and exit.
ca_es: Consultar els servidors NNTP per si hi ha missatges per a redireccionar a les llistes de correu. Forma d'ús: gate_news [opcions] On les opcions són --help -h Mostra aquest missatge i surt.

source: Send password reminders for all lists to all users. This program scans all mailing lists and collects users and their passwords, grouped by the list's host_name if mm_cfg.VIRTUAL_HOST_OVERVIEW is true. Then one email message is sent to each unique user (per-virtual host) containing the list passwords and options url for the user. The password reminder comes from the mm_cfg.MAILMAN_SITE_LIST, which must exist. Usage: %(PROGRAM)s [options] Options: -l listname --listname=listname Send password reminders for the named list only. If omitted, reminders are sent for all lists. Multiple -l/--listname options are allowed. -h/--help Print this message and exit.
ca_es: Enviar recordatoris de contrasenya per totes les llistes a tots els usuaris. Aquest programa recorre totes les llistes de distribució i recopila els noms d'usuari i les seves contrasenyes, agrupats pel host_name de la llista si mm_cfg.VIRTUAL_HOST_OVERVIEW es true. Aleshores s'envia un missatge de correu electrònic a cada usuari per separat (per-virtual host) contenint les contrasenyes de les llistes i l'URL d'opcions per a l'usuari. El recordatori de contrasenya prové de la variable mm_cfg.MAILMAN_SITE_LIST que ha d'existir. Forma d'ús: %(PROGRAM)s [opcions] Opcions: -l nom_de_llista --listname=nom_de_llista Enviar el recordatori de contrasenya només per la llista indicada. Si s'omet, el recordatori s'envia a totes les llistes. Es permeten múltiples opcions -l/--listname. -h/--help Mostra aquest missatge i surt.

source: Password // URL
ca_es: Contrasenya // URL

source: %(host)s mailing list memberships reminder
ca_es: Recordatori de pertinença a les llistes de correu de %(host)s

source: Re-generate the Pipermail gzip'd archive flat files. This script should be run nightly from cron. When run from the command line, the following usage is understood: Usage: %(program)s [-v] [-h] [listnames] Where: --verbose -v print each file as it's being gzip'd --help -h print this message and exit listnames Optionally, only compress the .txt files for the named lists. Without this, all archivable lists are processed.
ca_es: Regenera els fitxers d'arxiu del Pipermail comprimits amb gzip. Aquest script hauria d'executar-se cada nit des del cron. Quan s'executa des de la línia d'ordres, la sintaxi es la següent: Forma d'ús: %(program)s [-v] [-h] [nomllistes] On: --verbose -v mostra el nom del fitxer mentre es comprimeix amb el gzip. --help -h mostra aquest missatge i surt listnames Opcionalment, comprimeix solament els fitxers .txt de les llistes indicades. Sense aquesta opció, es processen totes les llistes que es poden arxivar.

source: Dispatch digests for lists w/pending messages and digest_send_periodic set. Usage: %(PROGRAM)s [options] Options: -h / --help Print this message and exit. -l listname --listname=listname Send the digest for the given list only, otherwise the digests for all lists are sent out.
ca_es: Envia missatges agrupats a les llistes amb missatges pendents i amb digest_send_periodic sel·leccionat. Sintaxi: %(PROGRAM)s [opcions] Opcions: -h / --help Imprimeix aquest missatge i surt. -l listname --listname=nomllista Envia els missatges agrupats només per la llista especificada. Si no se n'especifica una, els envia a totes les llistes.
